In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import kurtosis
from scipy.stats import skew
from scipy import stats

df1 = pd.read_csv('ABgroup.csv')
df1

               user_id    group
0        VX6NLA-F5YMSW  control
1        2AXN3D-71ZN86     test
2        K78V3J-TQMV6F     test
3        Z2KEIG-LY3V4H     test
4        ND92RZ-SHG980  control
...                ...      ...
8639995  SCIQGB-VYD7YG     test
8639996  T4PH1E-0FS4DN     test
8639997  YTXXO7-UEM0CT     test
8639998  011P6E-A3WXVH     test
8639999  439YCZ-QM3U7F     test

[8640000 rows x 2 columns]

In [3]:
df2 = pd.read_csv('Platforms.csv')
df2

               user_id platform
0        NHFL0F-Y90OSH     XBox
1        MVPNHS-PBHB8S     XBox
2        1UWMRN-8NVCLI       PC
3        EHO5II-03X9PU      PS4
4        7C5ZAE-D1NCY9     XBox
...                ...      ...
8639995  EYD4LR-O1YYTX      PS4
8639996  J0MR5W-GAGC66     XBox
8639997  Z0EL54-J3BZC4      PS4
8639998  B5FT8W-AR75PV       PC
8639999  9PL6ZA-40IW97       PC

[8640000 rows x 2 columns]

In [4]:
df3 = pd.read_csv('Cash.csv')
df3

               user_id        date  cash
0        GGLSXL-U5BGGY  17.07.2021   200
1        DPWFFN-NL3VF8  16.07.2021   150
2        PASNNG-GVW4RR  11.07.2021  1100
3        4F0AW7-F40GY9  15.07.2021  1050
4        CEY6AF-YTSM4V  15.07.2021   150
...                ...         ...   ...
8639995  OWJZJH-CNSFHZ  17.07.2021  3150
8639996  A6ZAWD-VD21JU  15.07.2021   200
8639997  L9NUIR-HM22U9  15.07.2021   200
8639998  0A5AY6-NB4ZIS  15.07.2021   200
8639999  9UT53X-2N05KE  14.07.2021   100

[8640000 rows x 3 columns]

In [5]:
df4 = pd.read_csv('Money.csv')
df4

               user_id        date  money
0        N4TS2T-P7YTVX  15.07.2021   1.99
1        NX9S0D-VM20W8  16.07.2021   0.99
2        QYY6FW-FKHRND  15.07.2021   0.00
3        BRWH4Y-LPGBU6  14.07.2021   0.00
4        8O317F-4ASK53  13.07.2021   0.00
...                ...         ...    ...
8639995  V2QN9A-KTAB7P  15.07.2021   0.00
8639996  UH5OG7-7KLM76  14.07.2021   0.99
8639997  6O1AE8-8AEE55  17.07.2021   0.99
8639998  33AD2T-TNRERG  12.07.2021   0.99
8639999  MQBLE4-6ESC3O  14.07.2021   0.00

[8640000 rows x 3 columns]

In [6]:
df5 = pd.read_csv('Cheaters.csv')
df5

               user_id  cheaters
0        TWLWB9-L19SYJ         0
1        SD0L4U-1JG4WN         0
2        QZVG35-P8JKNU         0
3        S2VBV4-ZKBHI6         0
4        DDGKMQ-45SP8R         0
...                ...       ...
8639995  YEO1HH-AGE5U0         0
8639996  E0ZSN1-XK2WFG         0
8639997  8Q5R71-0BMJDP         0
8639998  KX15V0-ZJSW8T         0
8639999  HM5I1V-A0OQK8         0

[8640000 rows x 2 columns]

In [7]:
df5_clear = df5[df5['cheaters'] < 1]
df5_clear

               user_id  cheaters
0        TWLWB9-L19SYJ         0
1        SD0L4U-1JG4WN         0
2        QZVG35-P8JKNU         0
3        S2VBV4-ZKBHI6         0
4        DDGKMQ-45SP8R         0
...                ...       ...
8639995  YEO1HH-AGE5U0         0
8639996  E0ZSN1-XK2WFG         0
8639997  8Q5R71-0BMJDP         0
8639998  KX15V0-ZJSW8T         0
8639999  HM5I1V-A0OQK8         0

[8637176 rows x 2 columns]

In [8]:
df3.describe()

               cash
count  8.640000e+06
mean   7.634015e+02
std    8.836145e+02
min    0.000000e+00
25%    2.500000e+02
50%    7.000000e+02
75%    1.150000e+03
max    1.482000e+05

In [9]:
1.150000 * 10 ** 3

1150.0

In [10]:
df3_clear = df3[df3['cash'] < 1150]
df3_clear

               user_id        date  cash
0        GGLSXL-U5BGGY  17.07.2021   200
1        DPWFFN-NL3VF8  16.07.2021   150
2        PASNNG-GVW4RR  11.07.2021  1100
3        4F0AW7-F40GY9  15.07.2021  1050
4        CEY6AF-YTSM4V  15.07.2021   150
...                ...         ...   ...
8639994  R799ZE-9FIG3P  16.07.2021     0
8639996  A6ZAWD-VD21JU  15.07.2021   200
8639997  L9NUIR-HM22U9  15.07.2021   200
8639998  0A5AY6-NB4ZIS  15.07.2021   200
8639999  9UT53X-2N05KE  14.07.2021   100

[6330927 rows x 3 columns]

In [11]:
df2.drop_duplicates(inplace=True)

In [12]:
df1.drop_duplicates(inplace=True)

In [13]:
df3_clear.drop_duplicates(inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_5036\574377624.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3_clear.drop_duplicates(inplace=True)

In [14]:
df3_clear

               user_id        date  cash
0        GGLSXL-U5BGGY  17.07.2021   200
1        DPWFFN-NL3VF8  16.07.2021   150
2        PASNNG-GVW4RR  11.07.2021  1100
3        4F0AW7-F40GY9  15.07.2021  1050
4        CEY6AF-YTSM4V  15.07.2021   150
...                ...         ...   ...
8639994  R799ZE-9FIG3P  16.07.2021     0
8639996  A6ZAWD-VD21JU  15.07.2021   200
8639997  L9NUIR-HM22U9  15.07.2021   200
8639998  0A5AY6-NB4ZIS  15.07.2021   200
8639999  9UT53X-2N05KE  14.07.2021   100

[6330927 rows x 3 columns]

In [15]:
df5_clear.drop_duplicates(inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_5036\3325163520.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5_clear.drop_duplicates(inplace=True)

In [16]:
df5_clear

               user_id  cheaters
0        TWLWB9-L19SYJ         0
1        SD0L4U-1JG4WN         0
2        QZVG35-P8JKNU         0
3        S2VBV4-ZKBHI6         0
4        DDGKMQ-45SP8R         0
...                ...       ...
6746711  H64167-X6WL6M         0
6761784  RPT9IY-P0M6QC         0
6804930  TOMOLF-K9N5LJ         0
6979662  C960OB-19O8OT         0
7001267  28DENA-HWECBB         0

[1079647 rows x 2 columns]

In [17]:
merged = pd.merge(df5_clear, df1)

In [18]:
merged = pd.merge(merged, df2)

In [19]:
df3_clear = df3_clear.groupby('user_id').sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_5036\3041276352.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df3_clear = df3_clear.groupby('user_id').sum()

In [20]:
df4 = df4.groupby('user_id').sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_5036\2459434604.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df4 = df4.groupby('user_id').sum()

In [21]:
merged = pd.merge(merged, df3_clear, on='user_id', how='outer')

In [22]:
merged = pd.merge(merged, df4, on='user_id', how='outer')

In [23]:
merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1080000 entries, 0 to 1079999
Data columns (total 6 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   user_id   1080000 non-null  object
 1   cheaters  1079647 non-null  float64
 2   group     1079647 non-null  object
 3   platform  1079647 non-null  object
 4   cash      1079725 non-null  float64
 5   money     1080000 non-null  float64
dtypes: float64(3), object(3)
memory usage: 57.7+ MB

In [24]:
merged

               user_id  cheaters    group platform    cash  money
0        TWLWB9-L19SYJ       0.0     test      PS4  2850.0   7.94
1        SD0L4U-1JG4WN       0.0  control       PC  1600.0   1.98
2        QZVG35-P8JKNU       0.0     test      PS4  1000.0   3.96
3        S2VBV4-ZKBHI6       0.0     test       PC  2300.0   7.95
4        DDGKMQ-45SP8R       0.0  control     XBox  3600.0   6.94
...                ...       ...      ...      ...     ...    ...
1079995  ZQDH19-8TSYHQ       NaN      NaN      NaN     NaN   0.00
1079996  ZQXBU3-QQY4YE       NaN      NaN      NaN     NaN   0.00
1079997  ZWGYC2-P1BE96       NaN      NaN      NaN     NaN   0.00
1079998  ZXPGD5-0WQBUI       NaN      NaN      NaN     NaN   0.00
1079999  ZYSWTT-EY3CXP       NaN      NaN      NaN     NaN   0.00

[1080000 rows x 6 columns]

In [25]:
grouptest = merged[merged['group'] == 'test']
print(grouptest.describe(percentiles=[.50, .75, .95]))

       cheaters           cash          money
count  539474.0  539396.000000  539474.000000
mean        0.0    2657.783706       6.160425
std         0.0    1076.276137       1.913545
min         0.0       0.000000       0.000000
50%         0.0    2650.000000       5.950000
75%         0.0    3400.000000       6.960000
95%         0.0    4500.000000       8.960000
max         0.0    7650.000000      16.930000

In [26]:
groupcontrol = merged[merged['group'] == 'control']
print(groupcontrol.describe(percentiles=[.50, .75, .95]))

       cheaters           cash          money
count  540173.0  540102.000000  540173.000000
mean        0.0    2797.704878       5.827514
std         0.0    1079.753948       1.876359
min         0.0       0.000000       0.000000
50%         0.0    2750.000000       5.950000
75%         0.0    3550.000000       6.950000
95%         0.0    4600.000000       8.940000
max         0.0    7550.000000      15.930000

In [27]:
#mean по группам test и control получились примерно схожими, с малой погрешностью

In [28]:
#Доверительный интервал по тратам внутриигровой валюты группы test
def my_norm_confidence(grouptest=grouptest, column = "cash", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=grouptest[column].mean(), scale = grouptest[column].std())
    return interval

confidencecashtest = my_norm_confidence()
print(confidencecashtest)

(548.3212407960336, 4767.246171643065)

In [29]:
#Доверительный интервал по платежам группы test
def my_norm_confidence(grouptest=grouptest, column = "money", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=grouptest[column].mean(), scale = grouptest[column].std())
    return interval

confidencemoneytest = my_norm_confidence()
print(confidencemoneytest)

(2.409946309269707, 9.910903926330157)

In [30]:
#Доверительный интервал по тратам внутриигровой валюты группы control
def my_norm_confidence(groupcontrol=groupcontrol, column = "cash", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=groupcontrol[column].mean(), scale = groupcontrol[column].std())
    return interval

confidencecashcontrol = my_norm_confidence()
print(confidencecashcontrol)

(681.4260283957015, 4913.983727539289)

In [31]:
#Доверительный интервал по платежам группы control
def my_norm_confidence(groupcontrol=groupcontrol, column = "money", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=groupcontrol[column].mean(), scale = groupcontrol[column].std())
    return interval

confidencemoneycontrol = my_norm_confidence()
print(confidencemoneycontrol)

(2.14991743524198, 9.50511082422304)

In [32]:
#Показатели доверительных интервалов по контрольной и тестовой группе также примерно схожи, с малой погрешностью

In [33]:
pc = merged[merged['platform'] == 'PC']
print(pc.describe(percentiles=[.50, .75, .95]))

       cheaters           cash          money
count  359896.0  359747.000000  359896.000000
mean        0.0    2699.963863       5.952005
std         0.0    1087.138119       1.907779
min         0.0       0.000000       0.000000
50%         0.0    2650.000000       5.950000
75%         0.0    3450.000000       6.950000
95%         0.0    4550.000000       8.950000
max         0.0    7400.000000      16.930000

In [34]:
xbox = merged[merged['platform'] == 'XBox']
print(xbox.describe(percentiles=[.50, .75, .95]))

       cheaters           cash          money
count  360532.0  360532.000000  360532.000000
mean        0.0    2702.862714       6.118128
std         0.0    1072.731470       1.908655
min         0.0       0.000000       0.000000
50%         0.0    2650.000000       5.950000
75%         0.0    3400.000000       6.960000
95%         0.0    4500.000000       8.960000
max         0.0    7550.000000      15.930000

In [35]:
ps4 = merged[merged['platform'] == 'PS4']
print(ps4.describe(percentiles=[.50, .75, .95]))

       cheaters           cash          money
count  359219.0  359219.000000  359219.000000
mean        0.0    2780.675577       5.911077
std         0.0    1079.014360       1.884076
min         0.0       0.000000       0.000000
50%         0.0    2750.000000       5.950000
75%         0.0    3500.000000       6.950000
95%         0.0    4600.000000       8.950000
max         0.0    7650.000000      15.940000

In [36]:
#mean по платформам также получились примерно схожими, с легкой погрешностью

In [37]:
#Доверительный интервал по тратам внутриигровой валюты платформы PC
def my_norm_confidence(pc=pc, column = "cash", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=pc[column].mean(), scale = pc[column].std())
    return interval

confidencecashpc = my_norm_confidence()
print(confidencecashpc)

(569.2123040121528, 4830.715422973757)

In [38]:
#Доверительный интервал по платежам платформы PC
def my_norm_confidence(pc=pc, column = "money", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=pc[column].mean(), scale = pc[column].std())
    return interval

confidencemoneypc = my_norm_confidence()
print(confidencemoneypc)

(2.212827360191193, 9.69118346515835)

In [39]:
#Доверительный интервал по тратам внутриигровой валюты платформы Xbox
def my_norm_confidence(xbox=xbox, column = "cash", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=xbox[column].mean(), scale = xbox[column].std())
    return interval

confidencecashxbox = my_norm_confidence()
print(confidencecashxbox)

(600.3476671241638, 4805.37776085449)

In [40]:
#Доверительный интервал по платежам платформы XBox
def my_norm_confidence(xbox=xbox, column = "money", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=xbox[column].mean(), scale = xbox[column].std())
    return interval

confidencemoneyxbox = my_norm_confidence()
print(confidencemoneyxbox)

(2.3772321287434512, 9.859024014955306)

In [41]:
#Доверительный интервал по тратам внутриигровой валюты платформы PS4
def my_norm_confidence(ps4=ps4, column = "cash", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=ps4[column].mean(), scale = ps4[column].std())
    return interval

confidencecashps4 = my_norm_confidence()
print(confidencecashps4)

(665.8462916391336, 4895.504861835488)

In [42]:
#Доверительный интервал по платежам платформы PS4
def my_norm_confidence(ps4=ps4, column = "money", alpha = 0.95):
    interval = stats.norm.interval(alpha, loc=ps4[column].mean(), scale = ps4[column].std())
    return interval

confidencemoneyps4 = my_norm_confidence()
print(confidencemoneyps4)

(2.2183560104774536, 9.60379749476586)

In [43]:
#Доверительные интервалы по платформам схожи, однако, PS4 показала наиболее высокие траты внутриигровой валюты, однако 
#наиболее платежеспособными оказались пользователи платформы XBox

In [43]:
merged.to_csv('final.csv', sep =',', index_label = 'index')